---
kind: method
id: M:Autodesk.Revit.DB.Structure.EndTreatmentType.Create(Autodesk.Revit.DB.Document,System.String)
zh: 创建、新建、生成、建立、新增
source: html/75a20905-c88b-df7e-1adc-d6beb096bec9.htm
---
# Autodesk.Revit.DB.Structure.EndTreatmentType.Create Method

**中文**: 创建、新建、生成、建立、新增

Creates a new EndTreatmentType in a document and adds the input string to the endTreatment parameter.

## Syntax (C#)
```csharp
public static EndTreatmentType Create(
	Document doc,
	string strTreatment
)
```

## Parameters
- **doc** (`Autodesk.Revit.DB.Document`)
- **strTreatment** (`System.String`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null